Repository: kirilovdmitry7-gif/onebeauty_app
Catalog: lib/l10n/app_*.arb
Languages: es, ru

# appTitle
source: OneBeauty
es: [es] OneBeauty
ru: [ru] OneBeauty

# tabHealth
source: Health
es: [es] Health
ru: [ru] Health

# tabStudio
source: Studio
es: [es] Studio
ru: [ru] Studio

# tabStore
source: Store
es: [es] Store
ru: [ru] Store

source: Sign out
es: [es] Sign out
ru: [ru] Sign out

source: Saved
es: [es] Saved
ru: [ru] Saved

source: Save
es: [es] Save
ru: [ru] Save

source: Language
es: [es] Language
ru: [ru] Language

# profileTitle
source: Profile
es: [es] Profile
ru: [ru] Profile

# profileEmail
source: Email
es: [es] Email
ru: [ru] Email

# profilePhone
source: Phone
es: [es] Phone
ru: [ru] Phone

# profileDisplayName
source: Display name
es: [es] Display name
ru: [ru] Display name

# profileAccount
source: Account
es: [es] Account
ru: [ru] Account

# obHealthTitle
source: Daily health
es: [es] Daily health
ru: [ru] Daily health

# obHealthText
source: Track water, steps and sleep with simple daily checks.
es: [es] Track water, steps and sleep with simple daily checks.
ru: [ru] Track water, steps and sleep with simple daily checks.

# obStudioTitle
source: Studio
es: [es] Studio
ru: [ru] Studio

# obStudioText
source: Book sessions and keep your schedule tidy.
es: [es] Book sessions and keep your schedule tidy.
ru: [ru] Book sessions and keep your schedule tidy.

# obStoreTitle
source: Store
es: [es] Store
ru: [ru] Store

# obStoreText
source: Buy care products and accessories in one place.
es: [es] Buy care products and accessories in one place.
ru: [ru] Buy care products and accessories in one place.

# obSkip
source: Skip
es: [es] Skip
ru: [ru] Skip

# obNext
source: Next
es: [es] Next
ru: [ru] Next

# obStart
source: Start
es: [es] Start
ru: [ru] Start

# authTitle
source: Sign in / Register
es: [es] Sign in / Register
ru: [ru] Sign in / Register

# authLoginTab
source: Login
es: [es] Login
ru: [ru] Login

# authRegisterTab
source: Register
es: [es] Register
ru: [ru] Register

# authPhoneTab
source: Phone
es: [es] Phone
ru: [ru] Phone

# authContinueGoogle
source: Continue with Google
es: [es] Continue with Google
ru: [ru] Continue with Google

# authEmail
source: Email
es: [es] Email
ru: [ru] Email

# authPassword
source: Password
es: [es] Password
ru: [ru] Password

# authSignIn
source: Sign in
es: [es] Sign in
ru: [ru] Sign in

# authCreateAccount
source: Create account
es: [es] Create account
ru: [ru] Create account

# authPhone
source: Phone number
es: [es] Phone number
ru: [ru] Phone number

# authCodeHint
source: Verification code
es: [es] Verification code
ru: [ru] Verification code

# authSendCode
source: Send code
es: [es] Send code
ru: [ru] Send code

# greetHello
source: Hello! 👋
es: [es] Hello! 👋
ru: [ru] Hello! 👋

# greetHelloName
source: Hello, {name}! 👋
es: [es] Hello, {name}! 👋
ru: [ru] Hello, {name}! 👋

# goalHintHealth
source: Make small daily steps: water, steps, sleep.
es: [es] Make small daily steps: water, steps, sleep.
ru: [ru] Make small daily steps: water, steps, sleep.

# goalHintSkin
source: Skin-care tracker and tips are coming soon.
es: [es] Skin-care tracker and tips are coming soon.
ru: [ru] Skin-care tracker and tips are coming soon.

# goalHintFitness
source: Keep active: steps, stretch, sleep.
es: [es] Keep active: steps, stretch, sleep.
ru: [ru] Keep active: steps, stretch, sleep.

# healthResetTooltip
source: Reset today's checks
es: [es] Reset today's checks
ru: [ru] Reset today's checks

# surveyTitle
source: Quick survey
es: [es] Quick survey
ru: [ru] Quick survey

# surveyIntro
source: Takes under a minute and helps tailor recommendations.
es: [es] Takes under a minute and helps tailor recommendations.
ru: [ru] Takes under a minute and helps tailor recommendations.

# surveyBirthDate
source: Birth date
es: [es] Birth date
ru: [ru] Birth date

# surveyPickDate
source: Pick a date
es: [es] Pick a date
ru: [ru] Pick a date

# surveyGender
source: Gender
es: [es] Gender
ru: [ru] Gender

# surveyMale
source: Male
es: [es] Male
ru: [ru] Male

# surveyFemale
source: Female
es: [es] Female
ru: [ru] Female

# surveyOther
source: Other
es: [es] Other
ru: [ru] Other

# surveyGoal
source: Main goal
es: [es] Main goal
ru: [ru] Main goal

# surveyGoalHealth
source: Overall health
es: [es] Overall health
ru: [ru] Overall health

# surveyGoalSkin
source: Skin care
es: [es] Skin care
ru: [ru] Skin care

# surveyGoalFitness
source: Fitness shape
es: [es] Fitness shape
ru: [ru] Fitness shape

# surveySaveContinue
source: Save and continue
es: [es] Save and continue
ru: [ru] Save and continue

# surveyErrorFillAll
source: Please fill all fields
es: [es] Please fill all fields
ru: [ru] Please fill all fields

# studioMessage
source: Studio is coming soon.
es: [es] Studio is coming soon.
ru: [ru] Studio is coming soon.

# storeMessage
source: Store is coming soon.
es: [es] Store is coming soon.
ru: [ru] Store is coming soon.

# taskWater
source: Drink 8 glasses of water 💧
es: [es] Drink 8 glasses of water 💧
ru: [ru] Drink 8 glasses of water 💧

# taskSteps
source: Walk 6–8k steps 🚶
es: [es] Walk 6–8k steps 🚶
ru: [ru] Walk 6–8k steps 🚶

# taskSleep
source: Go to bed by 23:00 😴
es: [es] Go to bed by 23:00 😴
ru: [ru] Go to bed by 23:00 😴

# taskStretch
source: 5–10 min stretch 🤸
es: [es] 5–10 min stretch 🤸
ru: [ru] 5–10 min stretch 🤸

# taskMind
source: 5 min mindfulness 🧘
es: [es] 5 min mindfulness 🧘
ru: [ru] 5 min mindfulness 🧘

# authErrEmailPasswordRequired
source: Email and password are required
es: [es] Email and password are required
ru: [ru] Email and password are required

# authErrPhoneCodeRequired
source: Phone and code are required
es: [es] Phone and code are required
ru: [ru] Phone and code are required

# authErrInvalidCode
source: Invalid code (use 0000)
es: [es] Invalid code (use 0000)
ru: [ru] Invalid code (use 0000)

# healthBannerText
source: Hi there! 👋 We’ll add a skincare tracker and recommendations soon.
es: [es] Hi there! 👋 We’ll add a skincare tracker and recommendations soon.
ru: [ru] Hi there! 👋 We’ll add a skincare tracker and recommendations soon.

# resetToday
source: Reset today’s checks
es: [es] Reset today’s checks
ru: [ru] Reset today’s checks

# healthProgress
source: {done} of {total} done
es: [es] {done} of {total} done
ru: [ru] {done} of {total} done

# healthAllDone
source: All done for today! 🎉
es: [es] All done for today! 🎉
ru: [ru] All done for today! 🎉

# streakTitle
source: Your streak
es: [es] Your streak
ru: [ru] Your streak

# streakDays
source: {days} days in a row
es: [es] {days} days in a row
ru: [ru] {days} days in a row

# healthWeekTitle
source: This week
es: [es] This week
ru: [ru] This week

# healthDayDone
source: {done}/{total}
es: [es] {done}/{total}
ru: [ru] {done}/{total}

# surveyNext
source: Next
es: [es] Next
ru: [ru] Next

# surveyBack
source: Back
es: [es] Back
ru: [ru] Back

# surveySave
source: Save
es: [es] Save
ru: [ru] Save

# surveyAge
source: Age
es: [es] Age
ru: [ru] Age

# surveyFitness
source: Fitness level
es: [es] Fitness level
ru: [ru] Fitness level

# surveyBeginner
source: Beginner
es: [es] Beginner
ru: [ru] Beginner

# surveyIntermediate
source: Intermediate
es: [es] Intermediate
ru: [ru] Intermediate

# surveyAdvanced
source: Advanced
es: [es] Advanced
ru: [ru] Advanced

# surveyGoals
source: Goals
es: [es] Goals
ru: [ru] Goals

# goalWeightLoss
source: Weight loss
es: [es] Weight loss
ru: [ru] Weight loss

# goalBetterSleep
source: Better sleep
es: [es] Better sleep
ru: [ru] Better sleep

# goalEnergy
source: More energy
es: [es] More energy
ru: [ru] More energy

# goalDiscipline
source: Discipline
es: [es] Discipline
ru: [ru] Discipline

# goalStress
source: Less stress
es: [es] Less stress
ru: [ru] Less stress

# surveyLifestyle
source: Lifestyle
es: [es] Lifestyle
ru: [ru] Lifestyle

# lifestyleSedentary
source: Sedentary
es: [es] Sedentary
ru: [ru] Sedentary

# lifestyleActive
source: Active
es: [es] Active
ru: [ru] Active

# surveyRestrictions
source: Restrictions
es: [es] Restrictions
ru: [ru] Restrictions

# rVegan
source: Vegan
es: [es] Vegan
ru: [ru] Vegan

# rVegetarian
source: Vegetarian
es: [es] Vegetarian
ru: [ru] Vegetarian

# rNoAlcohol
source: No alcohol
es: [es] No alcohol
ru: [ru] No alcohol

# rNoCaffeine
source: No caffeine
es: [es] No caffeine
ru: [ru] No caffeine

# rAllergyNuts
source: Nut allergy
es: [es] Nut allergy
ru: [ru] Nut allergy

# rHypertension
source: Hypertension
es: [es] Hypertension
ru: [ru] Hypertension

# surveyBody
source: Body parameters
es: [es] Body parameters
ru: [ru] Body parameters

# surveyWeight
source: Weight (kg)
es: [es] Weight (kg)
ru: [ru] Weight (kg)

# surveyHeight
source: Height (cm)
es: [es] Height (cm)
ru: [ru] Height (cm)

# surveyStress
source: Stress level
es: [es] Stress level
ru: [ru] Stress level

# stressLow
source: Low
es: [es] Low
ru: [ru] Low

# stressMedium
source: Medium
es: [es] Medium
ru: [ru] Medium

# stressHigh
source: High
es: [es] High
ru: [ru] High

# surveySleep
source: Sleep quality
es: [es] Sleep quality
ru: [ru] Sleep quality

# sleepPoor
source: Poor
es: [es] Poor
ru: [ru] Poor

# sleepAverage
source: Average
es: [es] Average
ru: [ru] Average

# sleepGood
source: Good
es: [es] Good
ru: [ru] Good

# planTomorrow
source: Plan for tomorrow
es: [es] Plan for tomorrow
ru: [ru] Plan for tomorrow

# planToday
source: Plan for today
es: [es] Plan for today
ru: [ru] Plan for today

source: AI plan
es: [es] AI plan
ru: [ru] AI plan

# catalogTasks
source: Today's tasks
es: [es] Today's tasks
ru: [ru] Today's tasks

source: Add to plan
es: [es] Add to plan
ru: [ru] Add to plan

source: Added to plan
es: [es] Added to plan
ru: [ru] Added to plan

source: Close
es: [es] Close
ru: [ru] Close

# newFeatureTitle
source: Awesome new feature
es: [es] Awesome new feature
ru: [ru] Awesome new feature

# newFeatureDesc
source: Try our AI-based challenge generator!
es: [es] Try our AI-based challenge generator!
ru: [ru] Try our AI-based challenge generator!

# statsTitle
source: Health stats
es: [es] Health stats
ru: [ru] Health stats

source: AI test
es: [es] AI test
ru: [ru] AI test

# statsToday
source: Today
es: [es] Today
ru: [ru] Today

# statsYesterday
source: Yesterday
es: [es] Yesterday
ru: [ru] Yesterday

# stats7days
source: 7 days
es: [es] 7 days
ru: [ru] 7 days

# aiAdviceToday
source: Today’s tip
es: [es] Today’s tip
ru: [ru] Today’s tip

# aiAdviceWeekly
source: Weekly summary
es: [es] Weekly summary
ru: [ru] Weekly summary

# aiAdviceNudge
source: Reminder
es: [es] Reminder
ru: [ru] Reminder

# devTestMessage
source: Localization pipeline works!
es: [es] Localization pipeline works!
ru: [ru] Localization pipeline works!

# testAuto
source: Hello world
es: [es] Hello world
ru: [ru] Hello world
